#!/bin/bash

# Проверка наличия папки venv
if [ ! -d "venv" ]; then
    echo "Папка 'venv' не найдена. Создаем виртуальное окружение..."
    
    # Создание виртуального окружения
    python3 -m venv venv
    
    # Активируем виртуальное окружение
    source venv/bin/activate

    # Установка зависимостей из файла req.txt
    if [ -f "req.txt" ]; then
        echo "Устанавливаем зависимости из req.txt..."
        pip install -r req.txt
    else
        echo "Файл 'req.txt' не найден. Убедитесь, что он существует."
        exit 1
    fi

    echo "Виртуальное окружение и зависимости созданы."
else
    echo "Папка 'venv' уже существует. Активируем виртуальное окружение..."
fi

# Активируем виртуальное окружение
source venv/bin/activate

# Запуск проекта (здесь замените main.py на ваш основной файл)
echo "Запускаем проект..."
python src/main.py

# Деактивация (по желанию)
deactivate